Workspace/OpenFOAM-v1812-AD/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

# create the underlying block mesh
runApplication blockMesh

# create faceSet for burner inlet and faceZone for coupled wall
runApplication topoSet

# create burner inlet
runApplication createPatch -overwrite

# extrude Film
runApplication extrudeToRegionMesh -dict system/extrudeToRegionMeshDictFilm -overwrite

rm log.extrudeToRegionMesh

# extrude pyrolysis
runApplication extrudeToRegionMesh -dict system/extrudeToRegionMeshDictPyr -overwrite

# change samplePatch in the boundary to coupled patch betwee region0 and
# pyrolysis
runApplication changeDictionary -region filmRegion -constant

# create faceSets for inlet, outlet, sides for the Film
rm log.topoSet
runApplication topoSet -region filmRegion

rm log.createPatch
# create actual patches
runApplication createPatch -region filmRegion -overwrite

cp 0/ph_rgh.orig 0/ph_rgh

# Run
runApplication $(getApplication)

paraFoam -touchAll

#------------------------------------------------------------------------------
